socialNetwork/results/scaling-on-sweep-bench1.5-may20/benchmark1.5b-sweep-05-20-26_101641/istio/1800.txt
Running 2m test @ http://155.98.37.84:80
  16 threads and 128 connections

  Thread calibration: mean lat.: 32.170ms, rate sampling interval: 102ms
  Thread calibration: mean lat.: 32.353ms, rate sampling interval: 102ms
  Thread calibration: mean lat.: 32.503ms, rate sampling interval: 103ms
  Thread calibration: mean lat.: 32.443ms, rate sampling interval: 102ms
  Thread calibration: mean lat.: 32.253ms, rate sampling interval: 103ms
  Thread calibration: mean lat.: 31.254ms, rate sampling interval: 98ms
  Thread calibration: mean lat.: 31.960ms, rate sampling interval: 98ms
  Thread calibration: mean lat.: 31.713ms, rate sampling interval: 97ms
  Thread calibration: mean lat.: 31.017ms, rate sampling interval: 94ms
  Thread calibration: mean lat.: 31.294ms, rate sampling interval: 97ms
  Thread calibration: mean lat.: 31.669ms, rate sampling interval: 100ms
  Thread calibration: mean lat.: 30.763ms, rate sampling interval: 94ms
  Thread calibration: mean lat.: 31.905ms, rate sampling interval: 101ms
  Thread calibration: mean lat.: 32.185ms, rate sampling interval: 102ms
  Thread calibration: mean lat.: 30.986ms, rate sampling interval: 93ms
  Thread calibration: mean lat.: 31.955ms, rate sampling interval: 99ms

-----------------------------------------------------------------------
Test Results @ http://155.98.37.84:80 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    32.46ms   13.83ms  83.97ms   84.80%
    Req/Sec   112.32     31.04   188.00     69.08%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   27.38ms
 75.000%   36.42ms
 90.000%   50.59ms
 99.000%   83.97ms
 99.900%  118.85ms
 99.990%  164.86ms
 99.999%  208.38ms
100.000%  214.27ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      12.503     0.000000            1         1.00
      21.679     0.100000        19753         1.11
      23.311     0.200000        39660         1.25
      24.559     0.300000        59264         1.43
      25.871     0.400000        79070         1.67
      27.375     0.500000        98712         2.00
      28.335     0.550000       108658         2.22
      29.487     0.600000       118450         2.50
      31.055     0.650000       128351         2.86
      33.215     0.700000       138210         3.33
      36.415     0.750000       148057         4.00
      38.367     0.775000       152979         4.44
      40.479     0.800000       157943         5.00
      42.719     0.825000       162898         5.71
      45.023     0.850000       167775         6.67
      47.551     0.875000       172718         8.00
      48.959     0.887500       175186         8.89
      50.591     0.900000       177651        10.00
      52.415     0.912500       180144        11.43
      54.495     0.925000       182577        13.33
      57.183     0.937500       185048        16.00
      58.783     0.943750       186288        17.78
      60.511     0.950000       187529        20.00
      62.495     0.956250       188753        22.86
      64.863     0.962500       189987        26.67
      67.455     0.968750       191232        32.00
      68.863     0.971875       191845        35.56
      70.527     0.975000       192447        40.00
      72.511     0.978125       193069        45.71
      75.007     0.981250       193689        53.33
      77.631     0.984375       194303        64.00
      79.167     0.985938       194610        71.11
      80.831     0.987500       194920        80.00
      82.687     0.989062       195229        91.43
      84.991     0.990625       195533       106.67
      87.679     0.992188       195840       128.00
      89.279     0.992969       195999       142.22
      90.943     0.993750       196151       160.00
      93.119     0.994531       196304       182.86
      95.423     0.995313       196456       213.33
      97.791     0.996094       196610       256.00
      99.775     0.996484       196689       284.44
     101.247     0.996875       196765       320.00
     103.167     0.997266       196845       365.71
     105.471     0.997656       196920       426.67
     108.479     0.998047       196996       512.00
     110.079     0.998242       197034       568.89
     112.191     0.998437       197073       640.00
     114.367     0.998633       197111       731.43
     116.479     0.998828       197149       853.33
     119.295     0.999023       197190      1024.00
     120.447     0.999121       197207      1137.78
     123.519     0.999219       197226      1280.00
     126.079     0.999316       197247      1462.86
     128.639     0.999414       197265      1706.67
     132.351     0.999512       197285      2048.00
     133.631     0.999561       197294      2275.56
     135.551     0.999609       197304      2560.00
     137.855     0.999658       197313      2925.71
     140.799     0.999707       197324      3413.33
     143.743     0.999756       197332      4096.00
     147.839     0.999780       197337      4551.11
     150.783     0.999805       197342      5120.00
     155.775     0.999829       197347      5851.43
     158.335     0.999854       197352      6826.67
     163.071     0.999878       197357      8192.00
     164.863     0.999890       197360      9102.22
     165.247     0.999902       197361     10240.00
     168.831     0.999915       197364     11702.86
     171.775     0.999927       197366     13653.33
     177.407     0.999939       197368     16384.00
     178.431     0.999945       197370     18204.44
     179.455     0.999951       197371     20480.00
     180.095     0.999957       197372     23405.71
     181.375     0.999963       197373     27306.67
     184.959     0.999969       197374     32768.00
     188.543     0.999973       197375     36408.89
     202.367     0.999976       197376     40960.00
     202.367     0.999979       197376     46811.43
     205.823     0.999982       197377     54613.33
     205.823     0.999985       197377     65536.00
     208.383     0.999986       197378     72817.78
     208.383     0.999988       197378     81920.00
     208.383     0.999989       197378     93622.86
     212.095     0.999991       197379    109226.67
     212.095     0.999992       197379    131072.00
     212.095     0.999993       197379    145635.56
     212.095     0.999994       197379    163840.00
     212.095     0.999995       197379    187245.71
     214.271     0.999995       197380    218453.33
     214.271     1.000000       197380          inf
#[Mean    =       32.462, StdDeviation   =       13.835]
#[Max     =      214.144, Total count    =       197380]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  215133 requests in 2.00m, 2.95GB read
Requests/sec:   1793.24  
Transfer/sec:     25.20MB